project/atropos-go/etcd_concurrent_read-master/master/k150k_cancel/output/expensive_canceled_5ms/cheap_read.log
bench with linearizable range
 0 / 1000 B                                                                                                                                        !   0.00%INFO: 2023/06/12 14:48:03 ccResolverWrapper: sending new addresses to cc: [{localhost:2379 0  <nil>}]
INFO: 2023/06/12 14:48:03 balancerWrapper: got update addr from Notify: [{localhost:2379 <nil>}]
INFO: 2023/06/12 14:48:03 balancerWrapper: got update addr from Notify: [{localhost:2379 <nil>}]
 1000 / 1000 Boooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooo! 100.00% 9s

Summary:
  Total:	9.9905 secs.
  Slowest:	0.0042 secs.
  Fastest:	0.0002 secs.
  Average:	0.0005 secs.
  Stddev:	0.0004 secs.
  Requests/sec:	100.0951

Response time histogram:
  0.0002 [1]	|
  0.0006 [850]	|∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎
  0.0010 [79]	|∎∎∎
  0.0014 [17]	|
  0.0018 [24]	|∎
  0.0022 [15]	|
  0.0026 [6]	|
  0.0030 [1]	|
  0.0034 [2]	|
  0.0038 [2]	|
  0.0042 [3]	|

Latency distribution:
  10% in 0.0003 secs.
  25% in 0.0003 secs.
  50% in 0.0004 secs.
  75% in 0.0005 secs.
  90% in 0.0007 secs.
  95% in 0.0015 secs.
  99% in 0.0025 secs.
  99.9% in 0.0042 secs.